<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"95bd2fadbdd052ce9908b907f169d9a1023db235e0814a5f828b77d81aba2e1c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #580 at https://github.com/cal-itp/data-infra/actions/runs/17592720065","plan_out_hash":"34527275f07c2e3cfa90729f740dbb5ceb5dcd5537b98a9cc0f85029ea2a0f0d","plan_hash":"5925783a969ee05e1849a177e612cc7ad92afc308fe28b6c97665de3472cc322","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "4f1s3w==" -> (known after apply)
!~      detect_md5hash      = "IGkuSAy/G11WON5BKC761Q==" -> "different hash"
!~      generation          = 1751416667226953 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"
!~      md5hash             = "IGkuSAy/G11WON5BKC761Q==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/transit_database/_mart_transit_database.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "b8nOEw==" -> (known after apply)
!~      detect_md5hash      = "6xSVbYLmRIFEpaQwPKZw7w==" -> "different hash"
!~      generation          = 1752703532539764 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
!~      md5hash             = "6xSVbYLmRIFEpaQwPKZw7w==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/transit_database/dim_gtfs_datasets.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "iZj0CQ==" -> (known after apply)
!~      detect_md5hash      = "UCjs69xwq3UGgsaOM8eKTg==" -> "different hash"
!~      generation          = 1751416668944705 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/transit_database/dim_gtfs_datasets.sql"
!~      md5hash             = "UCjs69xwq3UGgsaOM8eKTg==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/dim_gtfs_datasets.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/transit_database/stg_transit_database__gtfs_datasets.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "kuuaEQ==" -> (known after apply)
!~      detect_md5hash      = "tPp55852vH6MEWCf4KHKHA==" -> "different hash"
!~      generation          = 1751416669798677 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/transit_database/stg_transit_database__gtfs_datasets.sql"
!~      md5hash             = "tPp55852vH6MEWCf4KHKHA==" -> (known after apply)
        name                = "data/warehouse/models/staging/transit_database/stg_transit_database__gtfs_datasets.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #580](https://github.com/cal-itp/data-infra/actions/runs/17592720065)